In [136]:
import pandas as pd
import numpy as np
import os

In [137]:
path = os.path.join('logTest.xlsx')

df = pd.read_excel(path)

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 718 entries, 0 to 717
Data columns (total 24 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   sessionNo        718 non-null    int64
 1   startHour        718 non-null    int64
 2   startWeekday     718 non-null    int64
 3   duration         718 non-null    float64
 4   cCount           718 non-null    int64
 5   cMinPrice        718 non-null    object
 6   cMaxPrice        718 non-null    object
 7   cSumPrice        718 non-null    object
 8   bCount           718 non-null    int64
 9   bMinPrice        718 non-null    object
 10  bMaxPrice        718 non-null    object
 11  bSumPrice        718 non-null    object
 12  bStep            718 non-null    object
 13  onlineStatus     718 non-null    object
 14  availability     718 non-null    object
 15  customerNo       718 non-null    object
 16  maxVal           718 non-null    object
 17  customerScore    718 non-null    object
 18  accountLifetime  718 non-null    object
 19  payments         718 non-null    object
 20  age              718 non-null    object
 21  address          718 non-null    object
 22  lastOrder        718 non-null    object
 23  order            718 non-null    object
dtypes: float64(1), int64(5), object(18)
memory usage: 134.8+ KB

In [139]:
df.describe()

,sessionNo,startHour,startWeekday,duration,cCount,bCount
count,718.000000,718.0,718.0,718.000000,718.000000,718.000000
mean,48.190808,6.0,5.0,1508.121380,25.614206,3.215877
std,29.864615,0.0,0.0,2202.972457,36.899051,3.326815
min,1.000000,6.0,5.0,0.000000,0.000000,0.000000
25%,22.000000,6.0,5.0,99.967500,2.000000,1.000000
50%,45.000000,6.0,5.0,469.699000,11.000000,2.000000
75%,73.000000,6.0,5.0,1864.959250,30.750000,5.000000
max,100.000000,6.0,5.0,8794.127000,162.000000,15.000000

In [140]:
df = df.replace('?', None)

In [141]:
df.isnull().sum()

sessionNo            0
startHour            0
startWeekday         0
duration             0
cCount               0
cMinPrice           88
cMaxPrice           88
cSumPrice           88
bCount               0
bMinPrice           94
bMaxPrice           94
bSumPrice           94
bStep              322
onlineStatus       261
availability       269
customerNo         385
maxVal             385
customerScore      385
accountLifetime    385
payments           385
age                385
address            385
lastOrder          385
order                0
dtype: int64

In [142]:
df = df[df['cCount'] != 0]

In [143]:
df.isnull().sum()

sessionNo            0
startHour            0
startWeekday         0
duration             0
cCount               0
cMinPrice            6
cMaxPrice            6
cSumPrice            6
bCount               0
bMinPrice           12
bMaxPrice           12
bSumPrice           12
bStep              304
onlineStatus       261
availability       269
customerNo         303
maxVal             303
customerScore      303
accountLifetime    303
payments           303
age                303
address            303
lastOrder          303
order                0
dtype: int64

In [144]:
df.drop(columns=['bStep', 'onlineStatus', 'availability', 'customerNo', 'maxVal', 'customerScore', 'accountLifetime', 'payments', 'age', 'lastOrder'],
        axis=1,
        inplace=True)

In [145]:
df.drop(columns=['address'], axis=1, inplace=True)

In [146]:
df.isnull().sum()

sessionNo        0
startHour        0
startWeekday     0
duration         0
cCount           0
cMinPrice        6
cMaxPrice        6
cSumPrice        6
bCount           0
bMinPrice       12
bMaxPrice       12
bSumPrice       12
order            0
dtype: int64

In [147]:
df.columns.isna()

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False])

In [148]:
nan_cols = [i for i in df.columns if df[i].isnull().any()]

In [149]:
nan_cols

['cMinPrice', 'cMaxPrice', 'cSumPrice', 'bMinPrice', 'bMaxPrice', 'bSumPrice']

In [150]:
df['cMinPrice'].unique()

array(['59.99', '29.99', '9.99', '4.99', '27.85', '19.99', '12.99',
       '129.99', '99.99', '3.0', '499.99', '12.0', '5.0', '5.99', '14.99',
       '199.99', '79.99', '2.99', '1.99', '0.8', '49.99', '29.0', '13.99',
       '6.99', '6.96', '34.99', '16.99', '7.99', '24.99', '27.99', '6.0',
       '139.99', '10.0', '699.0', '10.99', '7.0', '3.99', '8.99', '15.99',
       '169.0', '47.99', '39.99', '189.99', None, '89.99', '49.95',
       '4.95', '599.99', '8.0', '49.0', '15.95', '35.99', '1.0'],
      dtype=object)

In [151]:
for col in nan_cols:
    df[col] = df[col].astype('float64')
    # m = df[col].mean()
    # df[col].fillna(m)

In [152]:
for col in nan_cols:
    m = df[col].mean()
    df[col] = df[col].fillna(m)

In [153]:
df.isnull().sum()

sessionNo       0
startHour       0
startWeekday    0
duration        0
cCount          0
cMinPrice       0
cMaxPrice       0
cSumPrice       0
bCount          0
bMinPrice       0
bMaxPrice       0
bSumPrice       0
order           0
dtype: int64

In [155]:
df[nan_cols].round(2)

     cMinPrice  cMaxPrice  cSumPrice  bMinPrice  bMaxPrice  bSumPrice
0        59.99      59.99      59.99      59.99      59.99      59.99
1        59.99      59.99      59.99      59.99      59.99      59.99
2        59.99      59.99      59.99      59.99      59.99      59.99
8        29.99      29.99      89.97      29.99      29.99      29.99
9         9.99      29.99     109.95       9.99      29.99      39.98
..         ...        ...        ...        ...        ...        ...
713      49.99      49.99      49.99      49.99      49.99      49.99
714      49.99      49.99      49.99      49.99      49.99      49.99
715      49.99      49.99      49.99      49.99      49.99      49.99
716      49.99      49.99      49.99      49.99      49.99      49.99
717      49.99      49.99      49.99      49.99      49.99      49.99

[636 rows x 6 columns]

In [158]:
df.to_excel('processed.xlsx')